RIOT-OS/RIOT/cpu/efm32/families/ezr32wg/include/vendor/ezr32wg_usartrf.h
/***************************************************************************//**
 * @file
 * @brief EZR32WG_USARTRF register and bit field definitions
 *******************************************************************************
 * # License
 * <b>Copyright 2020 Silicon Laboratories Inc. www.silabs.com</b>
 *******************************************************************************
 *
 * SPDX-License-Identifier: Zlib
 *
 * The licensor of this software is Silicon Laboratories Inc.
 *
 * This software is provided 'as-is', without any express or implied
 * warranty. In no event will the authors be held liable for any damages
 * arising from the use of this software.
 *
 * Permission is granted to anyone to use this software for any purpose,
 * including commercial applications, and to alter it and redistribute it
 * freely, subject to the following restrictions:
 *
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software. If you use this software
 *    in a product, an acknowledgment in the product documentation would be
 *    appreciated but is not required.
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 * 3. This notice may not be removed or altered from any source distribution.
 *
 ******************************************************************************/

#ifdef __cplusplus
extern "C" {
#endif


#if defined(__ICCARM__)
#pragma system_include       /* Treat file as system include file. */
#elif defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
#pragma clang system_header  /* Treat file as system include file. */
#endif

/***************************************************************************//**
 * @addtogroup Parts
 * @{
 ******************************************************************************/

/***************************************************************************//**
 * @defgroup EZR32WG_USARTRF_BitFields
 * @{
 ******************************************************************************/

/* Bit fields for USARTRF CTRL */
#define _USARTRF_CTRL_RESETVALUE                0x00000000UL                               /**< Default value for USARTRF_CTRL */
#define _USARTRF_CTRL_MASK                      0x7DFFFF7FUL                               /**< Mask for USARTRF_CTRL */
#define USARTRF_CTRL_SYNC                       (0x1UL << 0)                               /**< USART Synchronous Mode */
#define _USARTRF_CTRL_SYNC_SHIFT                0                                          /**< Shift value for USART_SYNC */
#define _USARTRF_CTRL_SYNC_MASK                 0x1UL                                      /**< Bit mask for USART_SYNC */
#define _USARTRF_CTRL_SYNC_DEFAULT              0x00000000UL                               /**< Mode DEFAULT for USARTRF_CTRL */
#define USARTRF_CTRL_SYNC_DEFAULT               (_USARTRF_CTRL_SYNC_DEFAULT << 0)          /**< Shifted mode DEFAULT for USARTRF_CTRL */
#define USARTRF_CTRL_LOOPBK                     (0x1UL << 1)                               /**< Loopback Enable */
#define _USARTRF_CTRL_LOOPBK_SHIFT              1                                          /**< Shift value for USART_LOOPBK */
#define _USARTRF_CTRL_LOOPBK_MASK               0x2UL                                      /**< Bit mask for USART_LOOPBK */
#define _USARTRF_CTRL_LOOPBK_DEFAULT            0x00000000UL                               /**< Mode DEFAULT for USARTRF_CTRL */
#define USARTRF_CTRL_LOOPBK_DEFAULT             (_USARTRF_CTRL_LOOPBK_DEFAULT << 1)        /**< Shifted mode DEFAULT for USARTRF_CTRL */
#define USARTRF_CTRL_CCEN                       (0x1UL << 2)                               /**< Collision Check Enable */
#define _USARTRF_CTRL_CCEN_SHIFT                2                                          /**< Shift value for USART_CCEN */
#define _USARTRF_CTRL_CCEN_MASK                 0x4UL                                      /**< Bit mask for USART_CCEN */
#define _USARTRF_CTRL_CCEN_DEFAULT              0x00000000UL                               /**< Mode DEFAULT for USARTRF_CTRL */
#define USARTRF_CTRL_CCEN_DEFAULT               (_USARTRF_CTRL_CCEN_DEFAULT << 2)          /**< Shifted mode DEFAULT for USARTRF_CTRL */
#define USARTRF_CTRL_MPM                        (0x1UL << 3)                               /**< Multi-Processor Mode */
#define _USARTRF_CTRL_MPM_SHIFT                 3                                          /**< Shift value for USART_MPM */
#define _USARTRF_CTRL_MPM_MASK                  0x8UL                                      /**< Bit mask for USART_MPM */
#define _USARTRF_CTRL_MPM_DEFAULT               0x00000000UL                               /**< Mode DEFAULT for USARTRF_CTRL */
#define USARTRF_CTRL_MPM_DEFAULT                (_USARTRF_CTRL_MPM_DEFAULT << 3)           /**< Shifted mode DEFAULT for USARTRF_CTRL */
#define USARTRF_CTRL_MPAB                       (0x1UL << 4)                               /**< Multi-Processor Address-Bit */
#define _USARTRF_CTRL_MPAB_SHIFT                4                                          /**< Shift value for USART_MPAB */
#define _USARTRF_CTRL_MPAB_MASK                 0x10UL                                     /**< Bit mask for USART_MPAB */
#define _USARTRF_CTRL_MPAB_DEFAULT              0x00000000UL                               /**< Mode DEFAULT for USARTRF_CTRL */
#define USARTRF_CTRL_MPAB_DEFAULT               (_USARTRF_CTRL_MPAB_DEFAULT << 4)          /**< Shifted mode DEFAULT for USARTRF_CTRL */
#define _USARTRF_CTRL_OVS_SHIFT                 5                                          /**< Shift value for USART_OVS */
#define _USARTRF_CTRL_OVS_MASK                  0x60UL                                     /**< Bit mask for USART_OVS */
#define _USARTRF_CTRL_OVS_DEFAULT               0x00000000UL                               /**< Mode DEFAULT for USARTRF_CTRL */
#define _USARTRF_CTRL_OVS_X16                   0x00000000UL                               /**< Mode X16 for USARTRF_CTRL */
#define _USARTRF_CTRL_OVS_X8                    0x00000001UL                               /**< Mode X8 for USARTRF_CTRL */
#define _USARTRF_CTRL_OVS_X6                    0x00000002UL                               /**< Mode X6 for USARTRF_CTRL */
#define _USARTRF_CTRL_OVS_X4                    0x00000003UL                               /**< Mode X4 for USARTRF_CTRL */
#define USARTRF_CTRL_OVS_DEFAULT                (_USARTRF_CTRL_OVS_DEFAULT << 5)           /**< Shifted mode DEFAULT for USARTRF_CTRL */
#define USARTRF_CTRL_OVS_X16                    (_USARTRF_CTRL_OVS_X16 << 5)               /**< Shifted mode X16 for USARTRF_CTRL */
#define USARTRF_CTRL_OVS_X8                     (_USARTRF_CTRL_OVS_X8 << 5)                /**< Shifted mode X8 for USARTRF_CTRL */
#define USARTRF_CTRL_OVS_X6                     (_USARTRF_CTRL_OVS_X6 << 5)                /**< Shifted mode X6 for USARTRF_CTRL */
#define USARTRF_CTRL_OVS_X4                     (_USARTRF_CTRL_OVS_X4 << 5)                /**< Shifted mode X4 for USARTRF_CTRL */
#define USARTRF_CTRL_CLKPOL                     (0x1UL << 8)                               /**< Clock Polarity */
#define _USARTRF_CTRL_CLKPOL_SHIFT              8                                          /**< Shift value for USART_CLKPOL */
#define _USARTRF_CTRL_CLKPOL_MASK               0x100UL                                    /**< Bit mask for USART_CLKPOL */
#define _USARTRF_CTRL_CLKPOL_DEFAULT            0x00000000UL                               /**< Mode DEFAULT for USARTRF_CTRL */
#define _USARTRF_CTRL_CLKPOL_IDLELOW            0x00000000UL                               /**< Mode IDLELOW for USARTRF_CTRL */
#define _USARTRF_CTRL_CLKPOL_IDLEHIGH           0x00000001UL                               /**< Mode IDLEHIGH for USARTRF_CTRL */
#define USARTRF_CTRL_CLKPOL_DEFAULT             (_USARTRF_CTRL_CLKPOL_DEFAULT << 8)        /**< Shifted mode DEFAULT for USARTRF_CTRL */
#define USARTRF_CTRL_CLKPOL_IDLELOW             (_USARTRF_CTRL_CLKPOL_IDLELOW << 8)        /**< Shifted mode IDLELOW for USARTRF_CTRL */
#define USARTRF_CTRL_CLKPOL_IDLEHIGH            (_USARTRF_CTRL_CLKPOL_IDLEHIGH << 8)       /**< Shifted mode IDLEHIGH for USARTRF_CTRL */
#define USARTRF_CTRL_CLKPHA                     (0x1UL << 9)                               /**< Clock Edge For Setup/Sample */
#define _USARTRF_CTRL_CLKPHA_SHIFT              9                                          /**< Shift value for USART_CLKPHA */
#define _USARTRF_CTRL_CLKPHA_MASK               0x200UL                                    /**< Bit mask for USART_CLKPHA */
#define _USARTRF_CTRL_CLKPHA_DEFAULT            0x00000000UL                               /**< Mode DEFAULT for USARTRF_CTRL */
#define _USARTRF_CTRL_CLKPHA_SAMPLELEADING      0x00000000UL                               /**< Mode SAMPLELEADING for USARTRF_CTRL */
#define _USARTRF_CTRL_CLKPHA_SAMPLETRAILING     0x00000001UL                               /**< Mode SAMPLETRAILING for USARTRF_CTRL */
#define USARTRF_CTRL_CLKPHA_DEFAULT             (_USARTRF_CTRL_CLKPHA_DEFAULT << 9)        /**< Shifted mode DEFAULT for USARTRF_CTRL */
#define USARTRF_CTRL_CLKPHA_SAMPLELEADING       (_USARTRF_CTRL_CLKPHA_SAMPLELEADING << 9)  /**< Shifted mode SAMPLELEADING for USARTRF_CTRL */
#define USARTRF_CTRL_CLKPHA_SAMPLETRAILING      (_USARTRF_CTRL_CLKPHA_SAMPLETRAILING << 9) /**< Shifted mode SAMPLETRAILING for USARTRF_CTRL */
#define USARTRF_CTRL_MSBF                       (0x1UL << 10)                              /**< Most Significant Bit First */
#define _USARTRF_CTRL_MSBF_SHIFT                10                                         /**< Shift value for USART_MSBF */
#define _USARTRF_CTRL_MSBF_MASK                 0x400UL                                    /**< Bit mask for USART_MSBF */
#define _USARTRF_CTRL_MSBF_DEFAULT              0x00000000UL                               /**< Mode DEFAULT for USARTRF_CTRL */
#define USARTRF_CTRL_MSBF_DEFAULT               (_USARTRF_CTRL_MSBF_DEFAULT << 10)         /**< Shifted mode DEFAULT for USARTRF_CTRL */
#define USARTRF_CTRL_CSMA                       (0x1UL << 11)                              /**< Action On Slave-Select In Master Mode */
#define _USARTRF_CTRL_CSMA_SHIFT                11                                         /**< Shift value for USART_CSMA */
#define _USARTRF_CTRL_CSMA_MASK                 0x800UL                                    /**< Bit mask for USART_CSMA */
#define _USARTRF_CTRL_CSMA_DEFAULT              0x00000000UL                               /**< Mode DEFAULT for USARTRF_CTRL */
#define _USARTRF_CTRL_CSMA_NOACTION             0x00000000UL                               /**< Mode NOACTION for USARTRF_CTRL */
#define _USARTRF_CTRL_CSMA_GOTOSLAVEMODE        0x00000001UL                               /**< Mode GOTOSLAVEMODE for USARTRF_CTRL */
#define USARTRF_CTRL_CSMA_DEFAULT               (_USARTRF_CTRL_CSMA_DEFAULT << 11)         /**< Shifted mode DEFAULT for USARTRF_CTRL */
#define USARTRF_CTRL_CSMA_NOACTION              (_USARTRF_CTRL_CSMA_NOACTION << 11)        /**< Shifted mode NOACTION for USARTRF_CTRL */
#define USARTRF_CTRL_CSMA_GOTOSLAVEMODE         (_USARTRF_CTRL_CSMA_GOTOSLAVEMODE << 11)   /**< Shifted mode GOTOSLAVEMODE for USARTRF_CTRL */
#define USARTRF_CTRL_TXBIL                      (0x1UL << 12)                              /**< TX Buffer Interrupt Level */
#define _USARTRF_CTRL_TXBIL_SHIFT               12                                         /**< Shift value for USART_TXBIL */
#define _USARTRF_CTRL_TXBIL_MASK                0x1000UL                                   /**< Bit mask for USART_TXBIL */
#define _USARTRF_CTRL_TXBIL_DEFAULT             0x00000000UL                               /**< Mode DEFAULT for USARTRF_CTRL */
#define _USARTRF_CTRL_TXBIL_EMPTY               0x00000000UL                               /**< Mode EMPTY for USARTRF_CTRL */
#define _USARTRF_CTRL_TXBIL_HALFFULL            0x00000001UL                               /**< Mode HALFFULL for USARTRF_CTRL */
#define USARTRF_CTRL_TXBIL_DEFAULT              (_USARTRF_CTRL_TXBIL_DEFAULT << 12)        /**< Shifted mode DEFAULT for USARTRF_CTRL */
#define USARTRF_CTRL_TXBIL_EMPTY                (_USARTRF_CTRL_TXBIL_EMPTY << 12)          /**< Shifted mode EMPTY for USARTRF_CTRL */
#define USARTRF_CTRL_TXBIL_HALFFULL             (_USARTRF_CTRL_TXBIL_HALFFULL << 12)       /**< Shifted mode HALFFULL for USARTRF_CTRL */
#define USARTRF_CTRL_RXINV                      (0x1UL << 13)                              /**< Receiver Input Invert */
#define _USARTRF_CTRL_RXINV_SHIFT               13                                         /**< Shift value for USART_RXINV */
#define _USARTRF_CTRL_RXINV_MASK                0x2000UL                                   /**< Bit mask for USART_RXINV */
#define _USARTRF_CTRL_RXINV_DEFAULT             0x00000000UL                               /**< Mode DEFAULT for USARTRF_CTRL */
#define USARTRF_CTRL_RXINV_DEFAULT              (_USARTRF_CTRL_RXINV_DEFAULT << 13)        /**< Shifted mode DEFAULT for USARTRF_CTRL */
#define USARTRF_CTRL_TXINV                      (0x1UL << 14)                              /**< Transmitter output Invert */
#define _USARTRF_CTRL_TXINV_SHIFT               14                                         /**< Shift value for USART_TXINV */
#define _USARTRF_CTRL_TXINV_MASK                0x4000UL                                   /**< Bit mask for USART_TXINV */
#define _USARTRF_CTRL_TXINV_DEFAULT             0x00000000UL                               /**< Mode DEFAULT for USARTRF_CTRL */
#define USARTRF_CTRL_TXINV_DEFAULT              (_USARTRF_CTRL_TXINV_DEFAULT << 14)        /**< Shifted mode DEFAULT for USARTRF_CTRL */
#define USARTRF_CTRL_CSINV                      (0x1UL << 15)                              /**< Chip Select Invert */
#define _USARTRF_CTRL_CSINV_SHIFT               15                                         /**< Shift value for USART_CSINV */
#define _USARTRF_CTRL_CSINV_MASK                0x8000UL                                   /**< Bit mask for USART_CSINV */
#define _USARTRF_CTRL_CSINV_DEFAULT             0x00000000UL                               /**< Mode DEFAULT for USARTRF_CTRL */
#define USARTRF_CTRL_CSINV_DEFAULT              (_USARTRF_CTRL_CSINV_DEFAULT << 15)        /**< Shifted mode DEFAULT for USARTRF_CTRL */
#define USARTRF_CTRL_AUTOCS                     (0x1UL << 16)                              /**< Automatic Chip Select */
#define _USARTRF_CTRL_AUTOCS_SHIFT              16                                         /**< Shift value for USART_AUTOCS */
#define _USARTRF_CTRL_AUTOCS_MASK               0x10000UL                                  /**< Bit mask for USART_AUTOCS */
#define _USARTRF_CTRL_AUTOCS_DEFAULT            0x00000000UL                               /**< Mode DEFAULT for USARTRF_CTRL */
#define USARTRF_CTRL_AUTOCS_DEFAULT             (_USARTRF_CTRL_AUTOCS_DEFAULT << 16)       /**< Shifted mode DEFAULT for USARTRF_CTRL */
#define USARTRF_CTRL_AUTOTRI                    (0x1UL << 17)                              /**< Automatic TX Tristate */
#define _USARTRF_CTRL_AUTOTRI_SHIFT             17                                         /**< Shift value for USART_AUTOTRI */
#define _USARTRF_CTRL_AUTOTRI_MASK              0x20000UL                                  /**< Bit mask for USART_AUTOTRI */
#define _USARTRF_CTRL_AUTOTRI_DEFAULT           0x00000000UL                               /**< Mode DEFAULT for USARTRF_CTRL */
#define USARTRF_CTRL_AUTOTRI_DEFAULT            (_USARTRF_CTRL_AUTOTRI_DEFAULT << 17)      /**< Shifted mode DEFAULT for USARTRF_CTRL */
#define USARTRF_CTRL_SCMODE                     (0x1UL << 18)                              /**< SmartCard Mode */
#define _USARTRF_CTRL_SCMODE_SHIFT              18                                         /**< Shift value for USART_SCMODE */
#define _USARTRF_CTRL_SCMODE_MASK               0x40000UL                                  /**< Bit mask for USART_SCMODE */
#define _USARTRF_CTRL_SCMODE_DEFAULT            0x00000000UL                               /**< Mode DEFAULT for USARTRF_CTRL */
#define USARTRF_CTRL_SCMODE_DEFAULT             (_USARTRF_CTRL_SCMODE_DEFAULT << 18)       /**< Shifted mode DEFAULT for USARTRF_CTRL */
#define USARTRF_CTRL_SCRETRANS                  (0x1UL << 19)                              /**< SmartCard Retransmit */
#define _USARTRF_CTRL_SCRETRANS_SHIFT           19                                         /**< Shift value for USART_SCRETRANS */
#define _USARTRF_CTRL_SCRETRANS_MASK            0x80000UL                                  /**< Bit mask for USART_SCRETRANS */
#define _USARTRF_CTRL_SCRETRANS_DEFAULT         0x00000000UL                               /**< Mode DEFAULT for USARTRF_CTRL */
#define USARTRF_CTRL_SCRETRANS_DEFAULT          (_USARTRF_CTRL_SCRETRANS_DEFAULT << 19)    /**< Shifted mode DEFAULT for USARTRF_CTRL */
#define USARTRF_CTRL_SKIPPERRF                  (0x1UL << 20)                              /**< Skip Parity Error Frames */
#define _USARTRF_CTRL_SKIPPERRF_SHIFT           20                                         /**< Shift value for USART_SKIPPERRF */
#define _USARTRF_CTRL_SKIPPERRF_MASK            0x100000UL                                 /**< Bit mask for USART_SKIPPERRF */
#define _USARTRF_CTRL_SKIPPERRF_DEFAULT         0x00000000UL                               /**< Mode DEFAULT for USARTRF_CTRL */
#define USARTRF_CTRL_SKIPPERRF_DEFAULT          (_USARTRF_CTRL_SKIPPERRF_DEFAULT << 20)    /**< Shifted mode DEFAULT for USARTRF_CTRL */
#define USARTRF_CTRL_BIT8DV                     (0x1UL << 21)                              /**< Bit 8 Default Value */
#define _USARTRF_CTRL_BIT8DV_SHIFT              21                                         /**< Shift value for USART_BIT8DV */
#define _USARTRF_CTRL_BIT8DV_MASK               0x200000UL                                 /**< Bit mask for USART_BIT8DV */
#define _USARTRF_CTRL_BIT8DV_DEFAULT            0x00000000UL                               /**< Mode DEFAULT for USARTRF_CTRL */
#define USARTRF_CTRL_BIT8DV_DEFAULT             (_USARTRF_CTRL_BIT8DV_DEFAULT << 21)       /**< Shifted mode DEFAULT for USARTRF_CTRL */
#define USARTRF_CTRL_ERRSDMA                    (0x1UL << 22)                              /**< Halt DMA On Error */
#define _USARTRF_CTRL_ERRSDMA_SHIFT             22                                         /**< Shift value for USART_ERRSDMA */
#define _USARTRF_CTRL_ERRSDMA_MASK              0x400000UL                                 /**< Bit mask for USART_ERRSDMA */
#define _USARTRF_CTRL_ERRSDMA_DEFAULT           0x00000000UL                               /**< Mode DEFAULT for USARTRF_CTRL */
#define USARTRF_CTRL_ERRSDMA_DEFAULT            (_USARTRF_CTRL_ERRSDMA_DEFAULT << 22)      /**< Shifted mode DEFAULT for USARTRF_CTRL */
#define USARTRF_CTRL_ERRSRX                     (0x1UL << 23)                              /**< Disable RX On Error */
#define _USARTRF_CTRL_ERRSRX_SHIFT              23                                         /**< Shift value for USART_ERRSRX */
#define _USARTRF_CTRL_ERRSRX_MASK               0x800000UL                                 /**< Bit mask for USART_ERRSRX */
#define _USARTRF_CTRL_ERRSRX_DEFAULT            0x00000000UL                               /**< Mode DEFAULT for USARTRF_CTRL */
#define USARTRF_CTRL_ERRSRX_DEFAULT             (_USARTRF_CTRL_ERRSRX_DEFAULT << 23)       /**< Shifted mode DEFAULT for USARTRF_CTRL */
#define USARTRF_CTRL_ERRSTX                     (0x1UL << 24)                              /**< Disable TX On Error */
#define _USARTRF_CTRL_ERRSTX_SHIFT              24                                         /**< Shift value for USART_ERRSTX */
#define _USARTRF_CTRL_ERRSTX_MASK               0x1000000UL                                /**< Bit mask for USART_ERRSTX */
#define _USARTRF_CTRL_ERRSTX_DEFAULT            0x00000000UL                               /**< Mode DEFAULT for USARTRF_CTRL */
#define USARTRF_CTRL_ERRSTX_DEFAULT             (_USARTRF_CTRL_ERRSTX_DEFAULT << 24)       /**< Shifted mode DEFAULT for USARTRF_CTRL */
#define _USARTRF_CTRL_TXDELAY_SHIFT             26                                         /**< Shift value for USART_TXDELAY */
#define _USARTRF_CTRL_TXDELAY_MASK              0xC000000UL                                /**< Bit mask for USART_TXDELAY */
#define _USARTRF_CTRL_TXDELAY_DEFAULT           0x00000000UL                               /**< Mode DEFAULT for USARTRF_CTRL */
#define _USARTRF_CTRL_TXDELAY_NONE              0x00000000UL                               /**< Mode NONE for USARTRF_CTRL */
#define _USARTRF_CTRL_TXDELAY_SINGLE            0x00000001UL                               /**< Mode SINGLE for USARTRF_CTRL */
#define _USARTRF_CTRL_TXDELAY_DOUBLE            0x00000002UL                               /**< Mode DOUBLE for USARTRF_CTRL */
#define _USARTRF_CTRL_TXDELAY_TRIPLE            0x00000003UL                               /**< Mode TRIPLE for USARTRF_CTRL */
#define USARTRF_CTRL_TXDELAY_DEFAULT            (_USARTRF_CTRL_TXDELAY_DEFAULT << 26)      /**< Shifted mode DEFAULT for USARTRF_CTRL */
#define USARTRF_CTRL_TXDELAY_NONE               (_USARTRF_CTRL_TXDELAY_NONE << 26)         /**< Shifted mode NONE for USARTRF_CTRL */
#define USARTRF_CTRL_TXDELAY_SINGLE             (_USARTRF_CTRL_TXDELAY_SINGLE << 26)       /**< Shifted mode SINGLE for USARTRF_CTRL */
#define USARTRF_CTRL_TXDELAY_DOUBLE             (_USARTRF_CTRL_TXDELAY_DOUBLE << 26)       /**< Shifted mode DOUBLE for USARTRF_CTRL */
#define USARTRF_CTRL_TXDELAY_TRIPLE             (_USARTRF_CTRL_TXDELAY_TRIPLE << 26)       /**< Shifted mode TRIPLE for USARTRF_CTRL */
#define USARTRF_CTRL_BYTESWAP                   (0x1UL << 28)                              /**< Byteswap In Double Accesses */
#define _USARTRF_CTRL_BYTESWAP_SHIFT            28                                         /**< Shift value for USART_BYTESWAP */
#define _USARTRF_CTRL_BYTESWAP_MASK             0x10000000UL                               /**< Bit mask for USART_BYTESWAP */
#define _USARTRF_CTRL_BYTESWAP_DEFAULT          0x00000000UL                               /**< Mode DEFAULT for USARTRF_CTRL */
#define USARTRF_CTRL_BYTESWAP_DEFAULT           (_USARTRF_CTRL_BYTESWAP_DEFAULT << 28)     /**< Shifted mode DEFAULT for USARTRF_CTRL */
#define USARTRF_CTRL_AUTOTX                     (0x1UL << 29)                              /**< Always Transmit When RX Not Full */
#define _USARTRF_CTRL_AUTOTX_SHIFT              29                                         /**< Shift value for USART_AUTOTX */
#define _USARTRF_CTRL_AUTOTX_MASK               0x20000000UL                               /**< Bit mask for USART_AUTOTX */
#define _USARTRF_CTRL_AUTOTX_DEFAULT            0x00000000UL                               /**< Mode DEFAULT for USARTRF_CTRL */
#define USARTRF_CTRL_AUTOTX_DEFAULT             (_USARTRF_CTRL_AUTOTX_DEFAULT << 29)       /**< Shifted mode DEFAULT for USARTRF_CTRL */
#define USARTRF_CTRL_MVDIS                      (0x1UL << 30)                              /**< Majority Vote Disable */
#define _USARTRF_CTRL_MVDIS_SHIFT               30                                         /**< Shift value for USART_MVDIS */
#define _USARTRF_CTRL_MVDIS_MASK                0x40000000UL                               /**< Bit mask for USART_MVDIS */
#define _USARTRF_CTRL_MVDIS_DEFAULT             0x00000000UL                               /**< Mode DEFAULT for USARTRF_CTRL */
#define USARTRF_CTRL_MVDIS_DEFAULT              (_USARTRF_CTRL_MVDIS_DEFAULT << 30)        /**< Shifted mode DEFAULT for USARTRF_CTRL */

