RIOT-OS/RIOT/cpu/efm32/families/ezr32wg/include/vendor/ezr32wg_usartrf.h
/* Bit fields for USARTRF CLKDIV */
#define _USARTRF_CLKDIV_RESETVALUE              0x00000000UL                       /**< Default value for USARTRF_CLKDIV */
#define _USARTRF_CLKDIV_MASK                    0x001FFFC0UL                       /**< Mask for USARTRF_CLKDIV */
#define _USARTRF_CLKDIV_DIV_SHIFT               6                                  /**< Shift value for USART_DIV */
#define _USARTRF_CLKDIV_DIV_MASK                0x1FFFC0UL                         /**< Bit mask for USART_DIV */
#define _USARTRF_CLKDIV_DIV_DEFAULT             0x00000000UL                       /**< Mode DEFAULT for USARTRF_CLKDIV */
#define USARTRF_CLKDIV_DIV_DEFAULT              (_USARTRF_CLKDIV_DIV_DEFAULT << 6) /**< Shifted mode DEFAULT for USARTRF_CLKDIV */

/* Bit fields for USARTRF RXDATAX */
#define _USARTRF_RXDATAX_RESETVALUE             0x00000000UL                           /**< Default value for USARTRF_RXDATAX */
#define _USARTRF_RXDATAX_MASK                   0x0000C1FFUL                           /**< Mask for USARTRF_RXDATAX */
#define _USARTRF_RXDATAX_RXDATA_SHIFT           0                                      /**< Shift value for USART_RXDATA */
#define _USARTRF_RXDATAX_RXDATA_MASK            0x1FFUL                                /**< Bit mask for USART_RXDATA */
#define _USARTRF_RXDATAX_RXDATA_DEFAULT         0x00000000UL                           /**< Mode DEFAULT for USARTRF_RXDATAX */
#define USARTRF_RXDATAX_RXDATA_DEFAULT          (_USARTRF_RXDATAX_RXDATA_DEFAULT << 0) /**< Shifted mode DEFAULT for USARTRF_RXDATAX */
#define USARTRF_RXDATAX_PERR                    (0x1UL << 14)                          /**< Data Parity Error */
#define _USARTRF_RXDATAX_PERR_SHIFT             14                                     /**< Shift value for USART_PERR */
#define _USARTRF_RXDATAX_PERR_MASK              0x4000UL                               /**< Bit mask for USART_PERR */
#define _USARTRF_RXDATAX_PERR_DEFAULT           0x00000000UL                           /**< Mode DEFAULT for USARTRF_RXDATAX */
#define USARTRF_RXDATAX_PERR_DEFAULT            (_USARTRF_RXDATAX_PERR_DEFAULT << 14)  /**< Shifted mode DEFAULT for USARTRF_RXDATAX */
#define USARTRF_RXDATAX_FERR                    (0x1UL << 15)                          /**< Data Framing Error */
#define _USARTRF_RXDATAX_FERR_SHIFT             15                                     /**< Shift value for USART_FERR */
#define _USARTRF_RXDATAX_FERR_MASK              0x8000UL                               /**< Bit mask for USART_FERR */
#define _USARTRF_RXDATAX_FERR_DEFAULT           0x00000000UL                           /**< Mode DEFAULT for USARTRF_RXDATAX */
#define USARTRF_RXDATAX_FERR_DEFAULT            (_USARTRF_RXDATAX_FERR_DEFAULT << 15)  /**< Shifted mode DEFAULT for USARTRF_RXDATAX */

/* Bit fields for USARTRF RXDATA */
#define _USARTRF_RXDATA_RESETVALUE              0x00000000UL                          /**< Default value for USARTRF_RXDATA */
#define _USARTRF_RXDATA_MASK                    0x000000FFUL                          /**< Mask for USARTRF_RXDATA */
#define _USARTRF_RXDATA_RXDATA_SHIFT            0                                     /**< Shift value for USART_RXDATA */
#define _USARTRF_RXDATA_RXDATA_MASK             0xFFUL                                /**< Bit mask for USART_RXDATA */
#define _USARTRF_RXDATA_RXDATA_DEFAULT          0x00000000UL                          /**< Mode DEFAULT for USARTRF_RXDATA */
#define USARTRF_RXDATA_RXDATA_DEFAULT           (_USARTRF_RXDATA_RXDATA_DEFAULT << 0) /**< Shifted mode DEFAULT for USARTRF_RXDATA */

/* Bit fields for USARTRF RXDOUBLEX */
#define _USARTRF_RXDOUBLEX_RESETVALUE           0x00000000UL                               /**< Default value for USARTRF_RXDOUBLEX */
#define _USARTRF_RXDOUBLEX_MASK                 0xC1FFC1FFUL                               /**< Mask for USARTRF_RXDOUBLEX */
#define _USARTRF_RXDOUBLEX_RXDATA0_SHIFT        0                                          /**< Shift value for USART_RXDATA0 */
#define _USARTRF_RXDOUBLEX_RXDATA0_MASK         0x1FFUL                                    /**< Bit mask for USART_RXDATA0 */
#define _USARTRF_RXDOUBLEX_RXDATA0_DEFAULT      0x00000000UL                               /**< Mode DEFAULT for USARTRF_RXDOUBLEX */
#define USARTRF_RXDOUBLEX_RXDATA0_DEFAULT       (_USARTRF_RXDOUBLEX_RXDATA0_DEFAULT << 0)  /**< Shifted mode DEFAULT for USARTRF_RXDOUBLEX */
#define USARTRF_RXDOUBLEX_PERR0                 (0x1UL << 14)                              /**< Data Parity Error 0 */
#define _USARTRF_RXDOUBLEX_PERR0_SHIFT          14                                         /**< Shift value for USART_PERR0 */
#define _USARTRF_RXDOUBLEX_PERR0_MASK           0x4000UL                                   /**< Bit mask for USART_PERR0 */
#define _USARTRF_RXDOUBLEX_PERR0_DEFAULT        0x00000000UL                               /**< Mode DEFAULT for USARTRF_RXDOUBLEX */
#define USARTRF_RXDOUBLEX_PERR0_DEFAULT         (_USARTRF_RXDOUBLEX_PERR0_DEFAULT << 14)   /**< Shifted mode DEFAULT for USARTRF_RXDOUBLEX */
#define USARTRF_RXDOUBLEX_FERR0                 (0x1UL << 15)                              /**< Data Framing Error 0 */
#define _USARTRF_RXDOUBLEX_FERR0_SHIFT          15                                         /**< Shift value for USART_FERR0 */
#define _USARTRF_RXDOUBLEX_FERR0_MASK           0x8000UL                                   /**< Bit mask for USART_FERR0 */
#define _USARTRF_RXDOUBLEX_FERR0_DEFAULT        0x00000000UL                               /**< Mode DEFAULT for USARTRF_RXDOUBLEX */
#define USARTRF_RXDOUBLEX_FERR0_DEFAULT         (_USARTRF_RXDOUBLEX_FERR0_DEFAULT << 15)   /**< Shifted mode DEFAULT for USARTRF_RXDOUBLEX */
#define _USARTRF_RXDOUBLEX_RXDATA1_SHIFT        16                                         /**< Shift value for USART_RXDATA1 */
#define _USARTRF_RXDOUBLEX_RXDATA1_MASK         0x1FF0000UL                                /**< Bit mask for USART_RXDATA1 */
#define _USARTRF_RXDOUBLEX_RXDATA1_DEFAULT      0x00000000UL                               /**< Mode DEFAULT for USARTRF_RXDOUBLEX */
#define USARTRF_RXDOUBLEX_RXDATA1_DEFAULT       (_USARTRF_RXDOUBLEX_RXDATA1_DEFAULT << 16) /**< Shifted mode DEFAULT for USARTRF_RXDOUBLEX */
#define USARTRF_RXDOUBLEX_PERR1                 (0x1UL << 30)                              /**< Data Parity Error 1 */
#define _USARTRF_RXDOUBLEX_PERR1_SHIFT          30                                         /**< Shift value for USART_PERR1 */
#define _USARTRF_RXDOUBLEX_PERR1_MASK           0x40000000UL                               /**< Bit mask for USART_PERR1 */
#define _USARTRF_RXDOUBLEX_PERR1_DEFAULT        0x00000000UL                               /**< Mode DEFAULT for USARTRF_RXDOUBLEX */
#define USARTRF_RXDOUBLEX_PERR1_DEFAULT         (_USARTRF_RXDOUBLEX_PERR1_DEFAULT << 30)   /**< Shifted mode DEFAULT for USARTRF_RXDOUBLEX */
#define USARTRF_RXDOUBLEX_FERR1                 (0x1UL << 31)                              /**< Data Framing Error 1 */
#define _USARTRF_RXDOUBLEX_FERR1_SHIFT          31                                         /**< Shift value for USART_FERR1 */
#define _USARTRF_RXDOUBLEX_FERR1_MASK           0x80000000UL                               /**< Bit mask for USART_FERR1 */
#define _USARTRF_RXDOUBLEX_FERR1_DEFAULT        0x00000000UL                               /**< Mode DEFAULT for USARTRF_RXDOUBLEX */
#define USARTRF_RXDOUBLEX_FERR1_DEFAULT         (_USARTRF_RXDOUBLEX_FERR1_DEFAULT << 31)   /**< Shifted mode DEFAULT for USARTRF_RXDOUBLEX */

/* Bit fields for USARTRF RXDOUBLE */
#define _USARTRF_RXDOUBLE_RESETVALUE            0x00000000UL                             /**< Default value for USARTRF_RXDOUBLE */
#define _USARTRF_RXDOUBLE_MASK                  0x0000FFFFUL                             /**< Mask for USARTRF_RXDOUBLE */
#define _USARTRF_RXDOUBLE_RXDATA0_SHIFT         0                                        /**< Shift value for USART_RXDATA0 */
#define _USARTRF_RXDOUBLE_RXDATA0_MASK          0xFFUL                                   /**< Bit mask for USART_RXDATA0 */
#define _USARTRF_RXDOUBLE_RXDATA0_DEFAULT       0x00000000UL                             /**< Mode DEFAULT for USARTRF_RXDOUBLE */
#define USARTRF_RXDOUBLE_RXDATA0_DEFAULT        (_USARTRF_RXDOUBLE_RXDATA0_DEFAULT << 0) /**< Shifted mode DEFAULT for USARTRF_RXDOUBLE */
#define _USARTRF_RXDOUBLE_RXDATA1_SHIFT         8                                        /**< Shift value for USART_RXDATA1 */
#define _USARTRF_RXDOUBLE_RXDATA1_MASK          0xFF00UL                                 /**< Bit mask for USART_RXDATA1 */
#define _USARTRF_RXDOUBLE_RXDATA1_DEFAULT       0x00000000UL                             /**< Mode DEFAULT for USARTRF_RXDOUBLE */
#define USARTRF_RXDOUBLE_RXDATA1_DEFAULT        (_USARTRF_RXDOUBLE_RXDATA1_DEFAULT << 8) /**< Shifted mode DEFAULT for USARTRF_RXDOUBLE */

/* Bit fields for USARTRF RXDATAXP */
#define _USARTRF_RXDATAXP_RESETVALUE            0x00000000UL                             /**< Default value for USARTRF_RXDATAXP */
#define _USARTRF_RXDATAXP_MASK                  0x0000C1FFUL                             /**< Mask for USARTRF_RXDATAXP */
#define _USARTRF_RXDATAXP_RXDATAP_SHIFT         0                                        /**< Shift value for USART_RXDATAP */
#define _USARTRF_RXDATAXP_RXDATAP_MASK          0x1FFUL                                  /**< Bit mask for USART_RXDATAP */
#define _USARTRF_RXDATAXP_RXDATAP_DEFAULT       0x00000000UL                             /**< Mode DEFAULT for USARTRF_RXDATAXP */
#define USARTRF_RXDATAXP_RXDATAP_DEFAULT        (_USARTRF_RXDATAXP_RXDATAP_DEFAULT << 0) /**< Shifted mode DEFAULT for USARTRF_RXDATAXP */
#define USARTRF_RXDATAXP_PERRP                  (0x1UL << 14)                            /**< Data Parity Error Peek */
#define _USARTRF_RXDATAXP_PERRP_SHIFT           14                                       /**< Shift value for USART_PERRP */
#define _USARTRF_RXDATAXP_PERRP_MASK            0x4000UL                                 /**< Bit mask for USART_PERRP */
#define _USARTRF_RXDATAXP_PERRP_DEFAULT         0x00000000UL                             /**< Mode DEFAULT for USARTRF_RXDATAXP */
#define USARTRF_RXDATAXP_PERRP_DEFAULT          (_USARTRF_RXDATAXP_PERRP_DEFAULT << 14)  /**< Shifted mode DEFAULT for USARTRF_RXDATAXP */
#define USARTRF_RXDATAXP_FERRP                  (0x1UL << 15)                            /**< Data Framing Error Peek */
#define _USARTRF_RXDATAXP_FERRP_SHIFT           15                                       /**< Shift value for USART_FERRP */
#define _USARTRF_RXDATAXP_FERRP_MASK            0x8000UL                                 /**< Bit mask for USART_FERRP */
#define _USARTRF_RXDATAXP_FERRP_DEFAULT         0x00000000UL                             /**< Mode DEFAULT for USARTRF_RXDATAXP */
#define USARTRF_RXDATAXP_FERRP_DEFAULT          (_USARTRF_RXDATAXP_FERRP_DEFAULT << 15)  /**< Shifted mode DEFAULT for USARTRF_RXDATAXP */

