RIOT-OS/RIOT/cpu/efm32/families/ezr32wg/include/vendor/ezr32wg_usartrf.h
/* Bit fields for USARTRF IRCTRL */
#define _USARTRF_IRCTRL_RESETVALUE              0x00000000UL                            /**< Default value for USARTRF_IRCTRL */
#define _USARTRF_IRCTRL_MASK                    0x000000FFUL                            /**< Mask for USARTRF_IRCTRL */
#define USARTRF_IRCTRL_IREN                     (0x1UL << 0)                            /**< Enable IrDA Module */
#define _USARTRF_IRCTRL_IREN_SHIFT              0                                       /**< Shift value for USART_IREN */
#define _USARTRF_IRCTRL_IREN_MASK               0x1UL                                   /**< Bit mask for USART_IREN */
#define _USARTRF_IRCTRL_IREN_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for USARTRF_IRCTRL */
#define USARTRF_IRCTRL_IREN_DEFAULT             (_USARTRF_IRCTRL_IREN_DEFAULT << 0)     /**< Shifted mode DEFAULT for USARTRF_IRCTRL */
#define _USARTRF_IRCTRL_IRPW_SHIFT              1                                       /**< Shift value for USART_IRPW */
#define _USARTRF_IRCTRL_IRPW_MASK               0x6UL                                   /**< Bit mask for USART_IRPW */
#define _USARTRF_IRCTRL_IRPW_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for USARTRF_IRCTRL */
#define _USARTRF_IRCTRL_IRPW_ONE                0x00000000UL                            /**< Mode ONE for USARTRF_IRCTRL */
#define _USARTRF_IRCTRL_IRPW_TWO                0x00000001UL                            /**< Mode TWO for USARTRF_IRCTRL */
#define _USARTRF_IRCTRL_IRPW_THREE              0x00000002UL                            /**< Mode THREE for USARTRF_IRCTRL */
#define _USARTRF_IRCTRL_IRPW_FOUR               0x00000003UL                            /**< Mode FOUR for USARTRF_IRCTRL */
#define USARTRF_IRCTRL_IRPW_DEFAULT             (_USARTRF_IRCTRL_IRPW_DEFAULT << 1)     /**< Shifted mode DEFAULT for USARTRF_IRCTRL */
#define USARTRF_IRCTRL_IRPW_ONE                 (_USARTRF_IRCTRL_IRPW_ONE << 1)         /**< Shifted mode ONE for USARTRF_IRCTRL */
#define USARTRF_IRCTRL_IRPW_TWO                 (_USARTRF_IRCTRL_IRPW_TWO << 1)         /**< Shifted mode TWO for USARTRF_IRCTRL */
#define USARTRF_IRCTRL_IRPW_THREE               (_USARTRF_IRCTRL_IRPW_THREE << 1)       /**< Shifted mode THREE for USARTRF_IRCTRL */
#define USARTRF_IRCTRL_IRPW_FOUR                (_USARTRF_IRCTRL_IRPW_FOUR << 1)        /**< Shifted mode FOUR for USARTRF_IRCTRL */
#define USARTRF_IRCTRL_IRFILT                   (0x1UL << 3)                            /**< IrDA RX Filter */
#define _USARTRF_IRCTRL_IRFILT_SHIFT            3                                       /**< Shift value for USART_IRFILT */
#define _USARTRF_IRCTRL_IRFILT_MASK             0x8UL                                   /**< Bit mask for USART_IRFILT */
#define _USARTRF_IRCTRL_IRFILT_DEFAULT          0x00000000UL                            /**< Mode DEFAULT for USARTRF_IRCTRL */
#define USARTRF_IRCTRL_IRFILT_DEFAULT           (_USARTRF_IRCTRL_IRFILT_DEFAULT << 3)   /**< Shifted mode DEFAULT for USARTRF_IRCTRL */
#define _USARTRF_IRCTRL_IRPRSSEL_SHIFT          4                                       /**< Shift value for USART_IRPRSSEL */
#define _USARTRF_IRCTRL_IRPRSSEL_MASK           0x70UL                                  /**< Bit mask for USART_IRPRSSEL */
#define _USARTRF_IRCTRL_IRPRSSEL_DEFAULT        0x00000000UL                            /**< Mode DEFAULT for USARTRF_IRCTRL */
#define _USARTRF_IRCTRL_IRPRSSEL_PRSCH0         0x00000000UL                            /**< Mode PRSCH0 for USARTRF_IRCTRL */
#define _USARTRF_IRCTRL_IRPRSSEL_PRSCH1         0x00000001UL                            /**< Mode PRSCH1 for USARTRF_IRCTRL */
#define _USARTRF_IRCTRL_IRPRSSEL_PRSCH2         0x00000002UL                            /**< Mode PRSCH2 for USARTRF_IRCTRL */
#define _USARTRF_IRCTRL_IRPRSSEL_PRSCH3         0x00000003UL                            /**< Mode PRSCH3 for USARTRF_IRCTRL */
#define _USARTRF_IRCTRL_IRPRSSEL_PRSCH4         0x00000004UL                            /**< Mode PRSCH4 for USARTRF_IRCTRL */
#define _USARTRF_IRCTRL_IRPRSSEL_PRSCH5         0x00000005UL                            /**< Mode PRSCH5 for USARTRF_IRCTRL */
#define _USARTRF_IRCTRL_IRPRSSEL_PRSCH6         0x00000006UL                            /**< Mode PRSCH6 for USARTRF_IRCTRL */
#define _USARTRF_IRCTRL_IRPRSSEL_PRSCH7         0x00000007UL                            /**< Mode PRSCH7 for USARTRF_IRCTRL */
#define USARTRF_IRCTRL_IRPRSSEL_DEFAULT         (_USARTRF_IRCTRL_IRPRSSEL_DEFAULT << 4) /**< Shifted mode DEFAULT for USARTRF_IRCTRL */
#define USARTRF_IRCTRL_IRPRSSEL_PRSCH0          (_USARTRF_IRCTRL_IRPRSSEL_PRSCH0 << 4)  /**< Shifted mode PRSCH0 for USARTRF_IRCTRL */
#define USARTRF_IRCTRL_IRPRSSEL_PRSCH1          (_USARTRF_IRCTRL_IRPRSSEL_PRSCH1 << 4)  /**< Shifted mode PRSCH1 for USARTRF_IRCTRL */
#define USARTRF_IRCTRL_IRPRSSEL_PRSCH2          (_USARTRF_IRCTRL_IRPRSSEL_PRSCH2 << 4)  /**< Shifted mode PRSCH2 for USARTRF_IRCTRL */
#define USARTRF_IRCTRL_IRPRSSEL_PRSCH3          (_USARTRF_IRCTRL_IRPRSSEL_PRSCH3 << 4)  /**< Shifted mode PRSCH3 for USARTRF_IRCTRL */
#define USARTRF_IRCTRL_IRPRSSEL_PRSCH4          (_USARTRF_IRCTRL_IRPRSSEL_PRSCH4 << 4)  /**< Shifted mode PRSCH4 for USARTRF_IRCTRL */
#define USARTRF_IRCTRL_IRPRSSEL_PRSCH5          (_USARTRF_IRCTRL_IRPRSSEL_PRSCH5 << 4)  /**< Shifted mode PRSCH5 for USARTRF_IRCTRL */
#define USARTRF_IRCTRL_IRPRSSEL_PRSCH6          (_USARTRF_IRCTRL_IRPRSSEL_PRSCH6 << 4)  /**< Shifted mode PRSCH6 for USARTRF_IRCTRL */
#define USARTRF_IRCTRL_IRPRSSEL_PRSCH7          (_USARTRF_IRCTRL_IRPRSSEL_PRSCH7 << 4)  /**< Shifted mode PRSCH7 for USARTRF_IRCTRL */
#define USARTRF_IRCTRL_IRPRSEN                  (0x1UL << 7)                            /**< IrDA PRS Channel Enable */
#define _USARTRF_IRCTRL_IRPRSEN_SHIFT           7                                       /**< Shift value for USART_IRPRSEN */
#define _USARTRF_IRCTRL_IRPRSEN_MASK            0x80UL                                  /**< Bit mask for USART_IRPRSEN */
#define _USARTRF_IRCTRL_IRPRSEN_DEFAULT         0x00000000UL                            /**< Mode DEFAULT for USARTRF_IRCTRL */
#define USARTRF_IRCTRL_IRPRSEN_DEFAULT          (_USARTRF_IRCTRL_IRPRSEN_DEFAULT << 7)  /**< Shifted mode DEFAULT for USARTRF_IRCTRL */

/* Bit fields for USARTRF ROUTE */
#define _USARTRF_ROUTE_RESETVALUE               0x00000000UL                           /**< Default value for USARTRF_ROUTE */
#define _USARTRF_ROUTE_MASK                     0x0000070FUL                           /**< Mask for USARTRF_ROUTE */
#define USARTRF_ROUTE_RXPEN                     (0x1UL << 0)                           /**< RX Pin Enable */
#define _USARTRF_ROUTE_RXPEN_SHIFT              0                                      /**< Shift value for USART_RXPEN */
#define _USARTRF_ROUTE_RXPEN_MASK               0x1UL                                  /**< Bit mask for USART_RXPEN */
#define _USARTRF_ROUTE_RXPEN_DEFAULT            0x00000000UL                           /**< Mode DEFAULT for USARTRF_ROUTE */
#define USARTRF_ROUTE_RXPEN_DEFAULT             (_USARTRF_ROUTE_RXPEN_DEFAULT << 0)    /**< Shifted mode DEFAULT for USARTRF_ROUTE */
#define USARTRF_ROUTE_TXPEN                     (0x1UL << 1)                           /**< TX Pin Enable */
#define _USARTRF_ROUTE_TXPEN_SHIFT              1                                      /**< Shift value for USART_TXPEN */
#define _USARTRF_ROUTE_TXPEN_MASK               0x2UL                                  /**< Bit mask for USART_TXPEN */
#define _USARTRF_ROUTE_TXPEN_DEFAULT            0x00000000UL                           /**< Mode DEFAULT for USARTRF_ROUTE */
#define USARTRF_ROUTE_TXPEN_DEFAULT             (_USARTRF_ROUTE_TXPEN_DEFAULT << 1)    /**< Shifted mode DEFAULT for USARTRF_ROUTE */
#define USARTRF_ROUTE_CSPEN                     (0x1UL << 2)                           /**< CS Pin Enable */
#define _USARTRF_ROUTE_CSPEN_SHIFT              2                                      /**< Shift value for USART_CSPEN */
#define _USARTRF_ROUTE_CSPEN_MASK               0x4UL                                  /**< Bit mask for USART_CSPEN */
#define _USARTRF_ROUTE_CSPEN_DEFAULT            0x00000000UL                           /**< Mode DEFAULT for USARTRF_ROUTE */
#define USARTRF_ROUTE_CSPEN_DEFAULT             (_USARTRF_ROUTE_CSPEN_DEFAULT << 2)    /**< Shifted mode DEFAULT for USARTRF_ROUTE */
#define USARTRF_ROUTE_CLKPEN                    (0x1UL << 3)                           /**< CLK Pin Enable */
#define _USARTRF_ROUTE_CLKPEN_SHIFT             3                                      /**< Shift value for USART_CLKPEN */
#define _USARTRF_ROUTE_CLKPEN_MASK              0x8UL                                  /**< Bit mask for USART_CLKPEN */
#define _USARTRF_ROUTE_CLKPEN_DEFAULT           0x00000000UL                           /**< Mode DEFAULT for USARTRF_ROUTE */
#define USARTRF_ROUTE_CLKPEN_DEFAULT            (_USARTRF_ROUTE_CLKPEN_DEFAULT << 3)   /**< Shifted mode DEFAULT for USARTRF_ROUTE */
#define _USARTRF_ROUTE_LOCATION_SHIFT           8                                      /**< Shift value for USART_LOCATION */
#define _USARTRF_ROUTE_LOCATION_MASK            0x700UL                                /**< Bit mask for USART_LOCATION */
#define _USARTRF_ROUTE_LOCATION_LOC0            0x00000000UL                           /**< Mode LOC0 for USARTRF_ROUTE */
#define _USARTRF_ROUTE_LOCATION_DEFAULT         0x00000000UL                           /**< Mode DEFAULT for USARTRF_ROUTE */
#define _USARTRF_ROUTE_LOCATION_LOC1            0x00000001UL                           /**< Mode LOC1 for USARTRF_ROUTE */
#define _USARTRF_ROUTE_LOCATION_LOC2            0x00000002UL                           /**< Mode LOC2 for USARTRF_ROUTE */
#define _USARTRF_ROUTE_LOCATION_LOC3            0x00000003UL                           /**< Mode LOC3 for USARTRF_ROUTE */
#define _USARTRF_ROUTE_LOCATION_LOC4            0x00000004UL                           /**< Mode LOC4 for USARTRF_ROUTE */
#define _USARTRF_ROUTE_LOCATION_LOC5            0x00000005UL                           /**< Mode LOC5 for USARTRF_ROUTE */
#define USARTRF_ROUTE_LOCATION_LOC0             (_USARTRF_ROUTE_LOCATION_LOC0 << 8)    /**< Shifted mode LOC0 for USARTRF_ROUTE */
#define USARTRF_ROUTE_LOCATION_DEFAULT          (_USARTRF_ROUTE_LOCATION_DEFAULT << 8) /**< Shifted mode DEFAULT for USARTRF_ROUTE */
#define USARTRF_ROUTE_LOCATION_LOC1             (_USARTRF_ROUTE_LOCATION_LOC1 << 8)    /**< Shifted mode LOC1 for USARTRF_ROUTE */
#define USARTRF_ROUTE_LOCATION_LOC2             (_USARTRF_ROUTE_LOCATION_LOC2 << 8)    /**< Shifted mode LOC2 for USARTRF_ROUTE */
#define USARTRF_ROUTE_LOCATION_LOC3             (_USARTRF_ROUTE_LOCATION_LOC3 << 8)    /**< Shifted mode LOC3 for USARTRF_ROUTE */
#define USARTRF_ROUTE_LOCATION_LOC4             (_USARTRF_ROUTE_LOCATION_LOC4 << 8)    /**< Shifted mode LOC4 for USARTRF_ROUTE */
#define USARTRF_ROUTE_LOCATION_LOC5             (_USARTRF_ROUTE_LOCATION_LOC5 << 8)    /**< Shifted mode LOC5 for USARTRF_ROUTE */

/* Bit fields for USARTRF INPUT */
#define _USARTRF_INPUT_RESETVALUE               0x00000000UL                           /**< Default value for USARTRF_INPUT */
#define _USARTRF_INPUT_MASK                     0x0000001FUL                           /**< Mask for USARTRF_INPUT */
#define _USARTRF_INPUT_RXPRSSEL_SHIFT           0                                      /**< Shift value for USART_RXPRSSEL */
#define _USARTRF_INPUT_RXPRSSEL_MASK            0xFUL                                  /**< Bit mask for USART_RXPRSSEL */
#define _USARTRF_INPUT_RXPRSSEL_DEFAULT         0x00000000UL                           /**< Mode DEFAULT for USARTRF_INPUT */
#define _USARTRF_INPUT_RXPRSSEL_PRSCH0          0x00000000UL                           /**< Mode PRSCH0 for USARTRF_INPUT */
#define _USARTRF_INPUT_RXPRSSEL_PRSCH1          0x00000001UL                           /**< Mode PRSCH1 for USARTRF_INPUT */
#define _USARTRF_INPUT_RXPRSSEL_PRSCH2          0x00000002UL                           /**< Mode PRSCH2 for USARTRF_INPUT */
#define _USARTRF_INPUT_RXPRSSEL_PRSCH3          0x00000003UL                           /**< Mode PRSCH3 for USARTRF_INPUT */
#define _USARTRF_INPUT_RXPRSSEL_PRSCH4          0x00000004UL                           /**< Mode PRSCH4 for USARTRF_INPUT */
#define _USARTRF_INPUT_RXPRSSEL_PRSCH5          0x00000005UL                           /**< Mode PRSCH5 for USARTRF_INPUT */
#define _USARTRF_INPUT_RXPRSSEL_PRSCH6          0x00000006UL                           /**< Mode PRSCH6 for USARTRF_INPUT */
#define _USARTRF_INPUT_RXPRSSEL_PRSCH7          0x00000007UL                           /**< Mode PRSCH7 for USARTRF_INPUT */
#define _USARTRF_INPUT_RXPRSSEL_PRSCH8          0x00000008UL                           /**< Mode PRSCH8 for USARTRF_INPUT */
#define _USARTRF_INPUT_RXPRSSEL_PRSCH9          0x00000009UL                           /**< Mode PRSCH9 for USARTRF_INPUT */
#define _USARTRF_INPUT_RXPRSSEL_PRSCH10         0x0000000AUL                           /**< Mode PRSCH10 for USARTRF_INPUT */
#define _USARTRF_INPUT_RXPRSSEL_PRSCH11         0x0000000BUL                           /**< Mode PRSCH11 for USARTRF_INPUT */
#define USARTRF_INPUT_RXPRSSEL_DEFAULT          (_USARTRF_INPUT_RXPRSSEL_DEFAULT << 0) /**< Shifted mode DEFAULT for USARTRF_INPUT */
#define USARTRF_INPUT_RXPRSSEL_PRSCH0           (_USARTRF_INPUT_RXPRSSEL_PRSCH0 << 0)  /**< Shifted mode PRSCH0 for USARTRF_INPUT */
#define USARTRF_INPUT_RXPRSSEL_PRSCH1           (_USARTRF_INPUT_RXPRSSEL_PRSCH1 << 0)  /**< Shifted mode PRSCH1 for USARTRF_INPUT */
#define USARTRF_INPUT_RXPRSSEL_PRSCH2           (_USARTRF_INPUT_RXPRSSEL_PRSCH2 << 0)  /**< Shifted mode PRSCH2 for USARTRF_INPUT */
#define USARTRF_INPUT_RXPRSSEL_PRSCH3           (_USARTRF_INPUT_RXPRSSEL_PRSCH3 << 0)  /**< Shifted mode PRSCH3 for USARTRF_INPUT */
#define USARTRF_INPUT_RXPRSSEL_PRSCH4           (_USARTRF_INPUT_RXPRSSEL_PRSCH4 << 0)  /**< Shifted mode PRSCH4 for USARTRF_INPUT */
#define USARTRF_INPUT_RXPRSSEL_PRSCH5           (_USARTRF_INPUT_RXPRSSEL_PRSCH5 << 0)  /**< Shifted mode PRSCH5 for USARTRF_INPUT */
#define USARTRF_INPUT_RXPRSSEL_PRSCH6           (_USARTRF_INPUT_RXPRSSEL_PRSCH6 << 0)  /**< Shifted mode PRSCH6 for USARTRF_INPUT */
#define USARTRF_INPUT_RXPRSSEL_PRSCH7           (_USARTRF_INPUT_RXPRSSEL_PRSCH7 << 0)  /**< Shifted mode PRSCH7 for USARTRF_INPUT */
#define USARTRF_INPUT_RXPRSSEL_PRSCH8           (_USARTRF_INPUT_RXPRSSEL_PRSCH8 << 0)  /**< Shifted mode PRSCH8 for USARTRF_INPUT */
#define USARTRF_INPUT_RXPRSSEL_PRSCH9           (_USARTRF_INPUT_RXPRSSEL_PRSCH9 << 0)  /**< Shifted mode PRSCH9 for USARTRF_INPUT */
#define USARTRF_INPUT_RXPRSSEL_PRSCH10          (_USARTRF_INPUT_RXPRSSEL_PRSCH10 << 0) /**< Shifted mode PRSCH10 for USARTRF_INPUT */
#define USARTRF_INPUT_RXPRSSEL_PRSCH11          (_USARTRF_INPUT_RXPRSSEL_PRSCH11 << 0) /**< Shifted mode PRSCH11 for USARTRF_INPUT */
#define USARTRF_INPUT_RXPRS                     (0x1UL << 4)                           /**< PRS RX Enable */
#define _USARTRF_INPUT_RXPRS_SHIFT              4                                      /**< Shift value for USART_RXPRS */
#define _USARTRF_INPUT_RXPRS_MASK               0x10UL                                 /**< Bit mask for USART_RXPRS */
#define _USARTRF_INPUT_RXPRS_DEFAULT            0x00000000UL                           /**< Mode DEFAULT for USARTRF_INPUT */
#define USARTRF_INPUT_RXPRS_DEFAULT             (_USARTRF_INPUT_RXPRS_DEFAULT << 4)    /**< Shifted mode DEFAULT for USARTRF_INPUT */

